const moment = require("moment-timezone");

module.exports = {
  config: {
    name: "auto",
    version: "2.0.0",
    role: 0,
    author: "siyam virus",
    description: "AutoTime",
    category: "autotime",
    countDown: 3
  },

  onLoad: async ({ api }) => {
    const messages = {
      "12:00:00 AM": { message: "༆-✿「সময় 12:00 AM」༊࿐•—»🍭𝐂𝐄𝐎𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«— 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____এক আকাশ ভালোবাসা এক মুঠো স্বপ্ন  আর এক জীবনের গল্প—সবই তোমার সাথে🌸🤍\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 -𝘼𝙧𝙞𝙮𝙖𝙣", attachmentURL: "" },
      "01:00:00 AM": { message: "༆-✿「সময় 1:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____ヅ ♡︎❥一༊❝ভয় নেই প্রিয় আমার গল্পে তুমি কোনদিন অপ্রিয় হবে না-\n╭────────────♡彡🫶 T?🥰\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n___________________.", attachmentURL: "https://files.catbox.moe/johb76.mp4" },
      "02:00:00 AM": { message: "༆-✿「সময় 2:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡 ︵🌻🖤༉- কারো বিরক্তের কারণ হওয়ার চেয়ে🙃একাকীত্বে হারিয়ে যাওয়া অনেক ভালো !ღ༎🙂🙂\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n\n╰•┄┅════❁🌺❁════┅┄•╯\n╭────────────♡彡\n╰➤😻🍭😽", attachmentURL: "https://files.catbox.moe/4r33da.mp4" },
      "03:00:00 AM": { message: "༆-✿「সময় 3:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢ \n╭────────────♡彡_____✵♡︎___কি হবে  এত  মানুষের প্রিয় হয়ে__🦋🌻__যদি আল্লাহ  প্রিয় না হতে পারি__🙂🦋_____✵♡︎\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀💫\n\n______________________________", attachmentURL: "https://files.catbox.moe/813e6d.mp4" },
      "04:00:00 AM": { message: "༆-✿「সময় 4:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____🌸💚–সম্পর্কের নাম যাই হোক না কেন–💙🌼.🖤🥀মন খারাপের সময় যে /পাশে থাকে🌺🌼🌺💞সেই প্রিয়  মানুষ ❥━➸➽❥🖤\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n_________________________", attachmentURL: "https://files.catbox.moe/johb76.mp4" },
      "05:00:00 AM": { message: "༆-✿「সময় 5:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•  💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____倫—•♡︎ সাইকোলজি বলে আপনি যখন কারো কথা মন থেকে ভাবেন পৃথিবীর অন্য প্রান্তে বসে সেই মানুষটা ও আপনার কথাই ভাবে🥺✨🎀\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/wjva2a.mp4" },
      "06:00:00 AM": { message: "༆-✿「সময় 6:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____𝄟✮⃝😅 যদি এক তরফা হতো তাহলে এক কথা ছিলো⎯⃝🥲❥ 𝄟✮͢⃟🙂≛⃝কিন্তু ভালো বাসি কথাটা সেও বলে ছিলো 𝄟✮⃝😅❤️‍🩹╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/g6nu2e.mp4" },
      "07:00:00 AM": { message: "༆-✿「সময় 7:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____⎯͢⎯⃝💙•—তার চোখে আমিও সুন্দর ছিলাম😊✨•|•যখন আমি তার প্রয়োজন ছিলাম👉💔👌⎯͢⎯⃝💙╰•┄┅════❁🌺❁════┅┄•╯ \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀\n______________________________", attachmentURL: "https://files.catbox.moe/ipe48w.mp4" },
      "08:00:00 AM": { message: "༆-✿「সময় 8:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____𒁍๛⃝ভা্ঁগ্য্ঁ ➤⃚፝͜͡❥̈́͜͡⃝টা্ঁও্ঁ এ্ঁক্ঁদি্ঁন্ঁ ক্লা্ঁন্ত্ঁ হ্ঁয়ে্ঁ 🌺ব্ঁল্ঁবে্ঁ যা্ঁ তো্ঁকে্ঁ‣᭄মু্ঁক্তি্ঁ⎯͢⁹¹⁸ ⸙দি্ঁলা্ঁম্ঁ😞😅╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/yx4yt0.mp4" },
      "09:00:00 AM": { message: "༆-✿「সময় 9:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡 _____⎯͢⎯⃝♡ভালোবাসা কোন বিলাসিতা বা শখ নয় ভালোবাসা হচ্ছে একটা মানুষের  প্রতি নিঃস্বার্থ অনুভূতি🩷⃝✿࿐╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/m4kr62.mp4" },
      "10:00:00 AM": { message: "༆-✿「সময় 10:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•  💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____এক আকাশ ভালোবাসা এক মুঠো স্বপ্ন  আর এক জীবনের গল্প—সবই তোমার সাথে🌸🤍╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/nz2jz8.mp4" },
      "11:00:00 AM": { message: "༆-✿「সময় 11:00AM」༊  •—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡 _____ヅ ♡︎❥一༊❝ভয় নেই প্রিয় আমার গল্পে তুমি কোনদিন অপ্রিয় হবে না-╭────────────♡彡 🫶 S=? Who nai🥰╰•┄┅════❁🌺❁════┅┄•╯ \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/s2hnpk.mp4" },
      "12:00:00 PM": { message: "༆-✿「সময় 12:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____👀🩵🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂কেউ প্রেম করতে চাইলে 𝄞⋆⃝⋆⃝𝄞♡🥀🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂নাম ঠিকানা😇🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂এক কপি ছবি 😊🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂নিয়ে inbox করুন😜🍂🥀𝄞⋆⃝⋆⃝𝄞♡🍂🥀𝄞⋆⃝⋆⃝𝄞🥀🍂অফার টি সীমিত🤭🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂সময়ের জন্য😒🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🐸😆🐸😆🐸🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝙎𝙀𝙔𝘼𝙈👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/1tjexq.mp4" },
      "01:00:00 PM": { message: "༆-✿「সময় 01:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡 _____👀🩵আজান দিচ্ছে 🫶🥰সবাই নামাজের জন্য তৈরি হোও😽💝  \n╭────────────♡\n彡\n✢━━━━━━━━━━━━━━━✢\nনামাজ বেহেশতের চাবি 🌈☺️\n✢━━━━━━━━━━━━━━━✢\nনামাজ বাদ দিও না বন্ধু 🫶😽        \n╭────────────♡\n彡এপারের চেয়ে ওপারের জীবন সুন্দর♡彡        \n╭────────────♡彡🫶😽 \n\n╰•┄┅════❁🌺❁════┅┄•╯ \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝙎𝙀𝙔𝘼𝙈👀🌻\n______________________________ ", attachmentURL: "https://files.catbox.moe/wi3pyd.mp4" },
      "02:00:00 PM": { message: "༆-✿「সময় 2:00 AM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____তুমি আমায় যতটা ভালোবাসো 🌈   ╭────────────♡彡আমি বিনা প্রকাশেই তোমায় তার থেকেও   ╭────────────♡彡 বেশি ভালোবাসি ❤️🌈🩵👀\n\n╰•┄┅════❁🌺❁════┅┄•╯ \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/rypdtm.mp4" },
      "03:00:00 PM": { message: "༆-✿「সময় 3:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____倫—•♡︎ সাইকোলজি বলে আপনি যখন কারো কথা মন থেকে ভাবেন পৃথিবীর অন্য প্রান্তে বসে সেই মানুষটা ও আপনার কথাই ভাবে🥺✨🎀\n\n╰•┄┅════❁🌺❁════┅┄•╯ \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/jsb1qj.mp4" },
      "04:00:00 PM": { message: "༆-✿「সময় 4:00 PM」༊࿐ •—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_________🌺সম্মান🤫_____🤗ভালোবাসা🌺______🌺বিশ্বাস🙄_____💚🌺এগুলো সহজে কাউকে দেওয়া ঠিক নয়😒😥কারণ সবাই এগুলোর মূল্য দিতে পারে না🌺💚____💚\n\n╰•┄┅════❁🌺❁════┅┄•\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/johb76.mp4" },
      "05:00:00 PM": { message: "༆-✿「সময় 5:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡_____𝄟✮⃝😅 যদি এক তরফা হতো তাহলে এক কথা ছিলো⎯⃝🥲❥ 𝄟✮͢⃟🙂≛⃝কিন্তু ভালো বাসি কথাটা সেও বলে ছিলো 𝄟✮⃝😅❤️‍🩹\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭𝘾 𝙀 𝙊 - 𝘼𝙧𝙞𝙮𝙖𝙣👀🌻\n______________________________", attachmentURL: "https://files.catbox.moe/coa4cg.mp4" },
      "06:00:00 PM": { message: "༆-✿「সময় 6:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n ✢━━━━━━━━━━━━━━━✢✢\n সিয়াম বস এখন ঘুমায় 😻🍭!🧚‍♀️ আর আমি পাহারা দিয়✢🧸🐰✢ ✢ ✢ ✢ 😻🍭!🧚‍♀️𝗜- তোরা তো  ঘুমাবি না কারন তোরা -কঠিন হাস্যকরভাবে ছ্যাঁকা খাওয়া পাবলিক 🧸\n ✢━━━━━━━━━━━━━━━✢\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡\n彡 ╰➤😻🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣🍥🧸", attachmentURL: "https://files.catbox.moe/6rhf4i.mp4" },
      "07:00:00 PM": { message: "༆-✿「সময় 7:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—• 💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n╭────────────♡彡╰➤\n🌈💫n𝗟𝗶𝗳𝗲 𝗶𝘀 𝗯𝗲𝗮𝘂𝘁𝗶𝗳𝘂𝗹 𝗶𝗳 𝘆𝗼𝘂 𝗗𝗼𝗻𝘁 𝗙𝗮𝗹𝗹 𝗶𝗻𝗟𝗼𝘃𝗲 ♡︎_জীবন সুন্দর যদি কারো মায়ায় না পড়ো -🙂🌈💝\n✢━━━━━━━━━━━━━━━✢\n\n╰•┄┅════❁🌺❁════┅┄•╯ \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡\n彡 ╰➤😻🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣🍥🧸", attachmentURL: "https://files.catbox.moe/6h5go8.mp4" },
      "08:00:00 PM": { message: "༆-✿「সময় 8:00 PM」༊࿐•—»🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣彡🌈«—•💫(✷‿✷)°🐹\n╭•┄┅════❁🌺❁════┅┄•╮\n\n✢━━━━━━━━━━━━━━━✢\n✢━━━━━━━━━━━━━━━✢\n🧸𝙈𝙮 𝘿𝙧𝙚𝙖𝙢𝙨 𝘿𝙤 𝙣𝙤𝙩 𝘾𝙤𝙢𝙚🌸     𝙩𝙧𝙪𝙚 𝙡𝙣 𝙡𝙢𝙖𝙜𝙞𝙣𝙖𝙩𝙞𝙤𝙣__🌼❥\n✢━━━━━━━━━━━━━━━✢\n༊আমার༊স্বপ্নগুলো༊তো༊কল্পনাতেই ভালো༊মানায়༊বাস্তবে༊না༉彡🌺\n\n╰•┄┅════❁🌺❁════┅┄•╯  \n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡\n彡 ╰➤😻🍭𝐂𝐄𝐎⸙𝘼𝙧𝙞𝙮𝙖𝙣🍥🧸", attachmentURL: "https://files.catbox.moe/xnfbr3.mp4" },
      "09:00:00 PM": { message: "সময় 9:00 PM「 === 「🌈💫」  ===\n--❖-(✷‿✷) --❖--\n✢━━━━━━━━━━━━━━━✢\n\n𝙗𝙚𝙡𝙞𝙚𝙫𝙚 𝙩𝙝𝙞𝙨 𝙡𝙞𝙣𝙚-!!🦋🐭\n\n🐰___🍒🖇️✨___ \n\n😍🦋᭄༊❥ভালো༊থাকার༊᭄ অপেক্ষা༊᭄\n\nকরতে❥করতে༊💜😍\n༊᭄ হয়তো༊᭄একদিন❥┼─༊😒😒💔\n👩‍❤️‍👨༊❥মৃত্যু༊᭄ এসে༊᭄ জীবনটাকে༊᭄থমকে❥┼দিবে─༊😔😔❤️\n\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 : 🏵-𝗕Ø𝗦𝗦• - 𝘼𝙧𝙞𝙮𝙖𝙣):<3🌻😽-🏵  」", attachmentURL: "https://files.catbox.moe/qba85e.mp4" },
      "10:00:00 PM": { message: "সময় 10:00 PM╭────────────♡彡 \n╰➤ \n\n💫(✷‿✷)°🐹\n╭•┄┅════❁\n❁════┅┄•\n\n\n__আসতাগ ফিরুল্লাহ__ \nআল্লাহ আমার প্রতি নিওতো করা গুনহা গুলি আপনি মাফ করেন \n\n\n•┄┅════❁🌺❁════┅┄•", attachmentURL: "https://files.catbox.moe/2u166p.mp4" },
      "11:00:00 PM": { message: "সময় 11:00 PM─────♡彡_____👀🩵🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂কেউ প্রেম করতে চাইলে 𝄞⋆⃝⋆⃝𝄞♡🥀🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂নাম ঠিকানা😇🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂এক কপি ছবি 😊🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂নিয়ে inbox করুন😜🍂🥀𝄞⋆⃝⋆⃝𝄞♡🍂🥀𝄞⋆⃝⋆⃝𝄞🥀🍂অফার টি সীমিত🤭🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂সময়ের জন্য😒🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂🐸😆🐸😆🐸🍂🥀𝄞⋆⃝⋆⃝𝄞♡🥀🍂\n\n╰•┄┅════❁🌺❁════┅┄•╯\n\n 𝐂𝐫𝐞𝐚𝐭𝐨𝐫 ✨🍥🌈\n\n╭────────────♡彡 ╰➤😻🍭", attachmentURL: "https://files.catbox.moe/ncndl1.mp4" }
    };

    const checkTime = () => {
      const now = moment().tz("Asia/Dhaka");
      const currentTime = now.format("hh:mm:ss A");

      const msg = messages[currentTime];
      if (msg) {
        const threads = global.db.allThreadData.map(thread => thread.threadID);
        threads.forEach(async threadID => {
          let messageData = { body: msg.message };
          if (msg.attachmentURL) {
            messageData.attachment = await global.utils.getStreamFromURL(msg.attachmentURL);
          }
          await api.sendMessage(messageData, threadID);
        });
      }

      const nextMinute = moment().add(1, 'minute').startOf('minute');
      const msUntilNextMinute = nextMinute.diff(moment());
      setTimeout(checkTime, msUntilNextMinute);
    };

    checkTime();
  },

  onStart: () => {}
};
